Data frames are 2d data structures .
Data is aligned in a tabular format consists of rows and columns
DataFrames can hold multiple data types
DataFrames Constructor in pandas is
pd.DataFrames(data=,index=,dtype=,copy)
data holds the data source
index holds the index to access the data source
dtype is type of the data
copy is self to false default. take a copy

In [3]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(101)      #### we get the same set of random numbers

In [6]:
#### creating a data frame using random number generator randn,use shift + tab to understand more about data frame parameters

df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [7]:
df

#### each of the column W,X,Y,Z is each a pandas series sharing a common index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
#### creating a data frame from a list
df_list = [['a1','b1','c1'],['a2','b2','c2'],['a3','b3','c3']]
df_list

#### to create user defined index, let us create a list of index
df_index = ['indx1','indx2','indx3']

In [11]:
### create dataframe from list
#data_Frame_list = pd.DataFrame(data=df_list)

data_Frame_list = pd.DataFrame(data=df_list,index=df_index,columns=('ColA','ColB','Colc'))
data_Frame_list

      ColA ColB Colc
indx1   a1   b1   c1
indx2   a2   b2   c2
indx3   a3   b3   c3

In [1]:
#### creating a dataframe from dictionary
#### let us create a new diction
df_dict = {'k1':(1,2,3),'k2':(20,30,40),'k3':(30,40,50),'k4':[100,200,300]}


### to make INDEXES FOR DATAFRAME
#data_Frame_dict = pd.DataFrame(data=df_dict,index=('I1','I2','I3','I4'),columns=('ColA','ColB','ColC','ColD'))
#data_Frame_dict


### to make INDEXES FOR DATAFRAME
#data_Frame_dict = pd.DataFrame(data=df_dict,index=('k1','k2','k3','k4'),columns=('ColA','ColB','ColC','ColD'))
#data_Frame_dict

In [7]:
### default creation
data_Frame_dict = pd.DataFrame(data=df_dict)
print(data_Frame_dict)

   k1  k2  k3   k4
0   1  20  30  100
1   2  30  40  200
2   3  40  50  300

####### Every column in a data frame is a series by itself
####### series is formed out of numpy arrays

dataframe --> within dataframe there is series ==> within series you have numpy arrays

In [16]:
pd.Series(data=df_dict)

k1          (1, 2, 3)
k2       (20, 30, 40)
k3       (30, 40, 50)
k4    [100, 200, 300]
dtype: object

In [18]:
### retreiving /accessing/grabbing/extracting data from a dataframe

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
#### to retrieve information from data frame
df['W']

#### note that the output is a series with user defined indexes and also its uni dimensional

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
### to verify whether every column in a data frame is a series or not
type(df['W'])

pandas.core.series.Series

In [10]:
### alternate way to retrieve data from df. THIS IS NOT RECOMMENDED 
### because using '.' can get confused with 
#### using methods
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
#### To retrieve multiple columns ..note the twin square brackets
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [12]:
df[['W','Z','X']]

#### Double bracket notation is enough to extract more than 1 column

          W         Z         X
A  2.706850  0.503826  0.628133
B  0.651118  0.605965 -0.319318
C -2.018168 -0.589001  0.740122
D  0.188695  0.955057 -0.758872
E  0.190794  0.683509  1.978757

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
#### creating a new column  - helps in feature creation
### df['new']   returns error that new column is not found

#### correct way of creating a new column or feature

df['new1']  = df['W'] + df['Y']

In [28]:
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
#### to remove columns from a data frame
df.drop('new1')   #### you will get an error "labels new not contained in axis

KeyError: "labels ['new1'] not contained in axis"

data  has 2 axis values

axis =0  represents a row in a dataframe
axis=1   represents a column in a dataframe

when no axis is given , axis=0 is assumed

- when we try to execute the command  df.drop('new1')   , python is searching for a row called "new1" (inspite of "new1" being a column) and it did not find it. as a result it gave the error " 
 KeyError: "labels ['new1'] not contained in axis"

In [30]:
df.drop('new1',axis=1)   
#### axis= 0 for drop method refers to index ('A','B')
#### axis=1  refer to columns W, X, Y,Z, new

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df
###observe that new1 is not permanently dropped

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [32]:
#### for hard deleting or dropping. inplace argument is needed 
df.drop('new1',axis=1,inplace=True)

In [33]:
df       ##### notice new column is permanently removed

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df1 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [38]:
df3 = df = pd.DataFrame(data=randn(5,4),index=['H','I','J','K','L'],columns= ['COL1','COL2','COL3','COL4'])

In [39]:
df2 = df = pd.DataFrame(data=randn(5,4),index=['H','I','J','K','L'],columns= ['M','N','O','P'])

In [40]:
df2

          M         N         O         P
H  1.606780 -1.115710 -1.385379 -1.329660
I  0.041460 -0.411055 -0.771329  0.110477
J -0.804652  0.253548  0.649148  0.358941
K -1.080471  0.902398  0.161781  0.833029
L  0.975720 -0.388239  0.783316 -0.708954

In [41]:
df3

       COL1      COL2      COL3      COL4
H -1.467514 -0.494095 -0.162535  0.485809
I  0.392489  0.221491 -0.855196  1.541990
J  0.666319 -0.538235 -0.568581  1.407338
K  0.641806 -0.905100 -0.391157  1.028293
L -1.972605 -0.866885  0.720788 -1.223082

In [42]:
#### dropping rows

df2.drop('L')

          M         N         O         P
H  1.606780 -1.115710 -1.385379 -1.329660
I  0.041460 -0.411055 -0.771329  0.110477
J -0.804652  0.253548  0.649148  0.358941
K -1.080471  0.902398  0.161781  0.833029

In [43]:
df2  ####  (no hard delete with rows as well)

          M         N         O         P
H  1.606780 -1.115710 -1.385379 -1.329660
I  0.041460 -0.411055 -0.771329  0.110477
J -0.804652  0.253548  0.649148  0.358941
K -1.080471  0.902398  0.161781  0.833029
L  0.975720 -0.388239  0.783316 -0.708954

In [44]:
#### hard deleting rows using inplace
df2.drop('L',inplace=True)

In [45]:
df2        #### note row E is premanently deleted

          M         N         O         P
H  1.606780 -1.115710 -1.385379 -1.329660
I  0.041460 -0.411055 -0.771329  0.110477
J -0.804652  0.253548  0.649148  0.358941
K -1.080471  0.902398  0.161781  0.833029

In [46]:
#### why are rows having axis =0 and columns have axis=1
### this is because they are built off of numpy arrays

In [47]:
df

          M         N         O         P
H  1.606780 -1.115710 -1.385379 -1.329660
I  0.041460 -0.411055 -0.771329  0.110477
J -0.804652  0.253548  0.649148  0.358941
K -1.080471  0.902398  0.161781  0.833029

In [50]:
#### to establish the above

df_shape=df.shape
print(df)
print(type(df_shape))

### the output is a touple, where indexs or rows ar 4 and columns are 4 too. 
#### that is rows are referred to as 0 axis and columns are 1 axis

          M         N         O         P
H  1.606780 -1.115710 -1.385379 -1.329660
I  0.041460 -0.411055 -0.771329  0.110477
J -0.804652  0.253548  0.649148  0.358941
K -1.080471  0.902398  0.161781  0.833029
<class 'tuple'>

In [52]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [54]:
#### selecting rows, by using .loc method. .loc is followed by [] and not ()
df1.loc['C']
### note that the rows are reported as series as well

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [55]:
df1.loc['C']

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [56]:
#### index location based look up
df1.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [57]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [32]:
#### to extract subset of rows and columns - example row B and Column Y

In [58]:
df1.loc['B','Y']

0.16690463609281317

In [59]:
#### SUBSETTING -Example 2 - extract values in row A and B, columns W and Y
df1.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [60]:
### extracting rows using iloc and slice notation - slice notations apply..go up to a row, but not include that row index
df1.iloc[0:2]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502

In [61]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [62]:
### adding rows into dataframe
rowadd_df= pd.DataFrame(data=randn(5,4),columns=['colA','colB','colC','colD'])
rowadd_df

       colA      colB      colC      colD
0  0.586847 -1.621348  0.677535  0.026105
1 -1.678284  0.333973 -0.532471  2.117727
2  0.197524  2.302987  0.729024 -0.863091
3  0.305632  0.243178  0.864165 -1.560931
4 -0.251897 -0.578120  0.236996  0.200780

In [63]:
newrows=pd.DataFrame(data=([[100,200,300,400],[600,700,800,900]]),index=(5,6),columns=['colA','colB','colC','colD'])

In [64]:
newrows2=pd.DataFrame(data=([[100,200,300,400],[600,700,800,900]]),columns=['colA','colB','colC','colD'])

In [65]:
newrows2

   colA  colB  colC  colD
0   100   200   300   400
1   600   700   800   900

In [66]:
rowadd_df=rowadd_df.append(newrows2)
rowadd_df

         colA        colB        colC        colD
0    0.586847   -1.621348    0.677535    0.026105
1   -1.678284    0.333973   -0.532471    2.117727
2    0.197524    2.302987    0.729024   -0.863091
3    0.305632    0.243178    0.864165   -1.560931
4   -0.251897   -0.578120    0.236996    0.200780
0  100.000000  200.000000  300.000000  400.000000
1  600.000000  700.000000  800.000000  900.000000

In [67]:
rowadd_df.loc[0]

         colA        colB        colC        colD
0    0.586847   -1.621348    0.677535    0.026105
0  100.000000  200.000000  300.000000  400.000000

In [68]:
### adding rows into dataframe
rowadd_df1 = pd.DataFrame(data=randn(5,4),columns=['colA','colB','colC','colD'])
rowadd_df1

       colA      colB      colC      colD
0  0.327845  0.674485 -0.174057  0.780140
1 -0.383258 -0.409318  0.343539  0.196275
2 -0.982776  2.231555 -0.971393 -1.522333
3  1.133703  0.528187  0.393461 -0.630507
4 -1.398290 -0.219311 -0.045676  0.012421

In [69]:
newrows1=pd.DataFrame(data=([[100,200,300,400],[600,700,800,900]]),index=(5,6),columns=['colE','colF','colG','colH'])

In [70]:
rowadd_df1=rowadd_df1.append(newrows1)
rowadd_df1

D:\anaconda\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

       colA      colB      colC      colD   colE   colF   colG   colH
0  0.327845  0.674485 -0.174057  0.780140    NaN    NaN    NaN    NaN
1 -0.383258 -0.409318  0.343539  0.196275    NaN    NaN    NaN    NaN
2 -0.982776  2.231555 -0.971393 -1.522333    NaN    NaN    NaN    NaN
3  1.133703  0.528187  0.393461 -0.630507    NaN    NaN    NaN    NaN
4 -1.398290 -0.219311 -0.045676  0.012421    NaN    NaN    NaN    NaN
5       NaN       NaN       NaN       NaN  100.0  200.0  300.0  400.0
6       NaN       NaN       NaN       NaN  600.0  700.0  800.0  900.0

In [71]:
newrows4=pd.DataFrame(data=([[100,200,300,400],[600,700,800,900]]),index=(3.5,3.6),columns=['colA','colB','colC','colD'])

In [72]:
#### INSERTING A ROW IN BETWEEN A DATA FRAME !!! 
rowadd_df1=rowadd_df1.insert(loc=3.5,)

TypeError: insert() missing 2 required positional arguments: 'column' and 'value'